20250501T191528--kdoc-354-ワード移動を可視化するパッケージを作る__project.org
:properties:
:ID: 20250501T191528
:mtime:    20250502072028
:ctime:    20250501191536
:end:
#+title:      KDOC 354: ワード移動を可視化するパッケージを作る
#+date:       [2025-05-01 Thu 19:15]
#+filetags:   :project:
#+identifier: 20250501T191528

* この文書のステータス
- 作成
  - [X] 2025-05-01 貴島
- レビュー
  - [X] 2025-05-02 貴島

* DONE プロジェクトのステータス
CLOSED: [2025-01-26 Sun 10:24]

プロジェクトは完了した。

* 概要
[[https://github.com/kijimaD/current-word-highlight][current-word-highlight]]は自作の[[id:1ad8c3d5-97ba-4905-be11-e6f2626127ad][Emacs]]ライブラリ。ワードごとの移動をしたいとき、日本語やコードだと区切りがわかりにくいため作成した。現在+前+次のword(単位は設定可能)をハイライト表示して移動しやすくする。
* Tasks
** TODO ハイライトのカラーリング調整
背景色で目が痛いので、コントラストを抑える。薄くする。
** TODO アニメーション
今の問題点: 表示がしつこい。元の文字が見えにくい。
カーソルが移動したときにチラっと表示されるだけでいい。
beaconを参考にハイライトする。
* 関連
なし。
