20250501T191528--kdoc-354-ワード移動を可視化するパッケージを作る__project.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-05-19 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 354: ワード移動を可視化するパッケージを作る</title>
<meta name="author" content="root" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 354: ワード移動を可視化するパッケージを作る</h1>
<div id="outline-container-org3c8af21" class="outline-2">
<h2 id="org3c8af21"><a href="#org3c8af21">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org3c8af21">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-05-01 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-05-02 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org8966699" class="outline-2">
<h2 id="org8966699"><a href="#org8966699"><span class="done DONE">DONE</span> プロジェクトのステータス</a></h2>
<div class="outline-text-2" id="text-org8966699">
<p>
プロジェクトは完了した。
</p>
</div>
</div>
<div id="outline-container-org98c44f1" class="outline-2">
<h2 id="org98c44f1"><a href="#org98c44f1">概要</a></h2>
<div class="outline-text-2" id="text-org98c44f1">
<p>
<a href="https://github.com/kijimaD/current-word-highlight">current-word-highlight</a>は自作の<a href="20210508234743-emacs.html#ID-1ad8c3d5-97ba-4905-be11-e6f2626127ad">Emacs</a>ライブラリ。ワードごとの移動をしたいとき、日本語やコードだと区切りがわかりにくいため作成した。現在+前+次のword(単位は設定可能)をハイライト表示して移動しやすくする。
</p>
</div>
</div>
<div id="outline-container-org078ef50" class="outline-2">
<h2 id="org078ef50"><a href="#org078ef50">Tasks</a></h2>
<div class="outline-text-2" id="text-org078ef50">
</div>
<div id="outline-container-orga9e3a69" class="outline-3">
<h3 id="orga9e3a69"><a href="#orga9e3a69"><span class="todo TODO">TODO</span> ハイライトのカラーリング調整</a></h3>
<div class="outline-text-3" id="text-orga9e3a69">
<p>
背景色で目が痛いので、コントラストを抑える。薄くする。
</p>
</div>
</div>
<div id="outline-container-org20cd158" class="outline-3">
<h3 id="org20cd158"><a href="#org20cd158"><span class="todo TODO">TODO</span> アニメーション</a></h3>
<div class="outline-text-3" id="text-org20cd158">
<p>
今の問題点: 表示がしつこい。元の文字が見えにくい。
カーソルが移動したときにチラっと表示されるだけでいい。
beaconを参考にハイライトする。
</p>
</div>
</div>
</div>
<div id="outline-container-org2ae33d9" class="outline-2">
<h2 id="org2ae33d9"><a href="#org2ae33d9">関連</a></h2>
<div class="outline-text-2" id="text-org2ae33d9">
<p>
なし。
</p>
</div>
</div>
<div id="outline-container-org67974d6" class="outline-2">
<h2 id="org67974d6"><a href="#org67974d6">Backlinks</a></h2>
<div class="outline-text-2" id="text-org67974d6">
<ul class="org-ul">
<li><a href="./20210817003906-history.html">History</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
